tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "supabase/tap"

brew "atuin"
brew "less"
brew "awscli"
brew "bat"
brew "carapace"
brew "chezmoi"
brew "deno"
brew "gh"
brew "eza"
brew "fd"
brew "fnm"
brew "git"
brew "just"
brew "micro"
brew "nushell"
brew "python-setuptools"
brew "ripgrep"
brew "scw"
brew "starship"
brew "vivid"
brew "zoxide"
brew "supabase/tap/supabase"
brew "noborus/tap/ov"
brew "delta"
brew "kubernetes-cli"
brew "kubectx"

cask "arc"
cask "raycast"
cask "iterm2"
cask "1password"
cask "1password-cli"
cask "visual-studio-code"
cask "orbstack"
cask "qlmarkdown"
cask "superkey"
cask "notion-calendar"
cask "tableplus"
cask "figma"
cask "cleanshot"
cask "iina"
cask "reverso"
cask "signal"
cask "devutils"
cask "usr-sse2-rdm"
cask "font-sauce-code-pro-nerd-font"

vscode "albert.tabout"
vscode "alefragnani.bookmarks"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "editorconfig.editorconfig"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "nefrob.vscode-just-syntax"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "reduckted.vscode-gitweblinks"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "styled-components.vscode-styled-components"
vscode "tamasfe.even-better-toml"
vscode "thenuprojectcontributors.vscode-nushell-lang"
vscode "unional.vscode-sort-package-json"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "waderyan.gitblame"
